# Definitions Class

---
A base class that supports the addition of new parameter definitions.
SystemObject Autodesk.Revit.DBDefinitions Autodesk.Revit.DBExternalDefinitions Autodesk.Revit.DBInternalDefinitions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class Definitions : IEnumerable<Definition>,
    	IDisposable

    Public Class Definitions
    	Implements IEnumerable(Of Definition), IDisposable

    public ref class Definitions : IEnumerable<Definition^>,
    	IDisposable

    type Definitions =
        class
            interface IEnumerable<Definition>
            interface IDisposable
        end
The Definitions type exposes the following members.
| Name| Description
---|---|---
| Definitions| Constructs an empty set of parameter definitions.
Top
| Name| Description
---|---|---
| IsEmpty| Identifies if the definitions collection is empty.
| Item| Retrieves a definition by a given name.
| Size| The number of definitions in the collection.
Top
| Name| Description
---|---|---
| Contains| Tests for the existence of a definition within the set.
| Create| Creates a new parameter definition using specified options.
| Dispose| Releases all resources used by the Definitions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetBasicIEnumerator| Returns an enumerator that iterates through a collection.
| GetEnumerator| Retrieves an enumerator to the collection.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
There are two derivations of this class, one of which handles external parameters and another which handles internal parameters.
#### Reference
Autodesk.Revit.DB Namespace